{"_entry":"ad","_objs":["Test Coverage Method","web-browsing","How can I track the test coverage?","browser","<ul><li>Create Product and System Test Design</li> <li>Create SW Test Design (Standard)</li> <li>Create SW Test Design and Test Cases (CS)</li> <li>Perform Module Test (Standard)</li> <li>Perform Pre-Integration Testing (Standard)</li> <li>Perform SW Integration Tests (CS)</li></ul>","Create Product and System Test Design","Essential","Design test cases and plans for both product and system testing to ensure all requirements are met and the system functions as expected.",{"point":"5","priority":"6","details":"7"},"Create SW Test Design (Standard)","Optional","Develop standardized software test designs that include test cases, test data, and test procedures to ensure software quality and functionality.",{"point":"9","priority":"a","details":"b"},"Create SW Test Design and Test Cases (CS)","Develop comprehensive test designs and detailed test cases for custom solutions to validate that all software components meet specified requirements.",{"point":"d","priority":"6","details":"e"},"Perform Module Test (Standard)","Execute tests on individual modules or components to verify their functionality and ensure they work correctly in isolation before integration.",{"point":"g","priority":"6","details":"h"},"Perform Pre-Integration Testing (Standard)","Conduct testing before the integration of components to identify and resolve issues early, ensuring smoother integration and overall system stability.",{"point":"j","priority":"6","details":"k"},"Perform SW Integration Tests (CS)","Execute integration tests on custom software to ensure that combined components work together as intended and meet the overall system requirements.",{"point":"m","priority":"6","details":"n"},["8","c","f","i","l","o"],"Privacy Browsers","https://github.com/Lissy93/awesome-privacy#browsers",{"title":"q","url":"r"},"Search Engines","https://github.com/Lissy93/awesome-privacy#search-engines",{"title":"t","utl":"u"},"Browser Extensions","https://github.com/Lissy93/awesome-privacy#browser-extensions",{"title":"w","url":"x"},"Browser & Bookmark Sync","https://github.com/Lissy93/awesome-privacy#browser-sync",{"title":"z","url":"10"},["s","v","y","11"],"orange",{"title":"0","slug":"1","description":"2","icon":"3","intro":"4","checklist":"p","softwareLinks":"12","color":"13"},"Software Clearing Methods and Tools","email","Third Party Software Components Compliance (aka Product Clearing)","Collect all OEM/SP Requirements <br /> Create SW High Level Design (Standard) <br /> Evaluate Technology Feasibility <br /> Perform Third Party Software Clearing <br /> Perform Variant Analysis <br /> Specify Architecture and High Level Designs <br /> Third Party Software Components Evaluation & Planning <br /> Update Product and System Architecture <br /> Verify Third Party Software Components Compliance (aka Product Clearing). ","Collect all OEM/SP Requirements","Gather and document all Original Equipment Manufacturer and Service Provider requirements.",{"point":"19","priority":"6","details":"1a"},"Create SW High Level Design (Standard)","Develop a high-level software design following standard guidelines.",{"point":"1c","priority":"6","details":"1d"},"Evaluate Technology Feasibility","Assess the feasibility of the technology for the project requirements and constraints.",{"point":"1f","priority":"6","details":"1g"},"Specify Architecture and High Level Designs","Define the architecture and high-level designs, ensuring they meet project requirements.",{"point":"1i","priority":"6","details":"1j"},"Third Party Software Components Evaluation & Planning","Evaluate and plan the integration of third-party software components, considering potential risks and benefits.",{"point":"1l","priority":"a","details":"1m"},"Update Product and System Architecture","Revise and update the product and system architecture to incorporate new requirements and improvements.",{"point":"1o","priority":"a","details":"1p"},"Verify Third Party Software Components Compliance","Ensure third-party software components comply with project standards and requirements.",{"point":"1r","priority":"a","details":"1s"},["1b","1e","1h","1k","1n","1q","1t"],"red",{"title":"15","slug":"16","description":"17","icon":"16","intro":"18","checklist":"1u","color":"1v"},"Pre-Requisites","Avoiding tracking, censorship, and data collection online","Process Variant and Master Documentation are initiated. ","Project Notebook Startup Version","Typical project folder structure are in placed",{"point":"20","priority":"6","details":"21"},"Process Variant determined and Tailoring","Any tailoring need might be needed according to budget, timelines and delivery nature",{"point":"23","priority":"6","details":"24"},["22","25"],{"title":"1x","slug":"1","description":"1y","icon":"3","intro":"1z","checklist":"26"},"Requirements Engineering Workflow","requirements","Requirements Engineering Workflow where Competitors and their products are analyzed and rated","password","yellow","Product Portfolio","Analyze Competition","Competitors and their products are analyzed and rated",{"point":"2e","priority":"6","details":"2f"},"Perform Positioning","Perform Positioning Classification of the new product is established in the SBT and the divisional product portfolio. The position of the new product in the market is determined",{"point":"2h","priority":"6","details":"2i"},"Analyze Market Opportunities","The current market situation is rated and opportunities and risks are analyzed",{"point":"2k","priority":"6","details":"2l"},"Identify Requirements","Advanced","The market assessment will be performed to collect market data, conditions, and user information",{"point":"2n","priority":"2o","details":"2p"},"Define User Scenarios","The relevant work processes of the customer, the users of the product/system, and the user tasks are analyzed by the product manager",{"point":"2r","priority":"2o","details":"2s"},"Specify customer Benefits","The advantages attained by the customer through use of the product/system are compiled",{"point":"2u","priority":"2o","details":"2v"},"Analyze Customers","Customers are analyzed and classified in consultation with experts from sales and marketing",{"point":"2x","priority":"2o","details":"2y"},"Benchmark competition","The competition’s products are benchmarked",{"point":"30","priority":"2o","details":"31"},"Create Service Concept","Define the product-specific service concept and the serviceability requirements determining how, in what depth and who performs service on the product and components Define service documentation requests",{"point":"33","priority":"2o","details":"34"},["2g","2j","2m","2q","2t","2w","2z","32","35"],"Requirement Engineering a complete overview","https://www.theknowledgeacademy.com/blog/requirements-engineering/",{"title":"37","url":"38"},"Requirements Engineering","https://link.springer.com/journal/766",{"title":"3a","url":"3b"},["39","3c"],{"title":"28","slug":"29","description":"2a","icon":"2b","color":"2c","intro":"2d","checklist":"36","softwareLinks":"3d"},"Product Management","product-management","Product Management workflow initiation","Typically covers the product vision and roadmap ownership","Project Summary created","Project Summary creation",{"point":"3j","priority":"6","details":"3k"},"Phase in Roadmap created","Basic","Phase In Roadmap Project Summary",{"point":"3m","priority":"3n","details":"3o"},"Product Manager is nominated",{"point":"3q","priority":"3n","details":"3q"},["3l","3p","3r"],{"title":"3f","slug":"3g","description":"3h","icon":"3","intro":"3i","checklist":"3s"},"Planning / Project Management","pm","Standard guidlines for Project Management Actcities, Reporting and Measurement Tool","A Project Leader is nominated.","Consider using a different email address for security-critical communications from trivial mail such as newsletters. This compartmentalization could reduce the amount of damage caused by a data breach, and also make it easier to recover a compromised account.",{"point":"3x","priority":"6","details":"3y"},"A Project Quality Manager is nominated.","Do not share your primary email publicly, as mail addresses are often the starting point for most phishing attacks.",{"point":"40","priority":"6","details":"41"},"A Project Architect is nominated","Use a long and unique password, enable 2FA and be careful while logging in. Your email account provides an easy entry point to all your other online accounts for an attacker.",{"point":"43","priority":"6","details":"44"},"Disable Automatic Loading of Remote Content","Email messages can contain remote content such as images or stylesheets, often automatically loaded from the server. You should disable this, as it exposes your IP address and device information, and is often used for tracking. For more info, see [this article](https://www.theverge.com/2019/7/3/20680903/email-pixel-trackers-how-to-stop-images-automatic-download).",{"point":"46","priority":"6","details":"47"},"Start-up version of Planning Document","There are two main types of emails on the internet: plaintext and HTML. The former is strongly preferred for privacy & security as HTML messages often include identifiers in links and inline images, which can collect usage and personal data. There's also numerous risks of remote code execution targeting the HTML parser of your mail client, which cannot be exploited if you are using plaintext. For more info, as well as setup instructions for your mail provider, see [UsePlaintext.email](https://useplaintext.email/).",{"point":"49","priority":"a","details":"4a"},"All required QA activities for the next phase are planned and given in the project planning.","If you give a third-party app or plug-in full access to your inbox, they effectively have full unhindered access to all your emails and their contents, which poses significant security and privacy risks.",{"point":"4c","priority":"a","details":"4d"},"Requirements for project team members have been specified","Emails are very easily intercepted. Furthermore, you can’t be sure of how secure your recipient's environment is. Therefore, emails cannot be considered safe for exchanging confidential information, unless it is encrypted.",{"point":"4f","priority":"a","details":"4g"},["3z","42","45","48","4b","4e","4h"],{"title":"3u","slug":"3v","description":"3w","icon":"16","intro":"3w","checklist":"4i"},"Product and Solution Security","pss","Keeping your communications private and secure","messaging","<ul> <li>Create Product and System Test Design</li> <li>Create Product and System Test Plan</li> <li>Create SW Detailed Design (Standard)</li> <li>Create SW High Level Design (Standard)</li> <li>Define SW Development Infrastructure (Standard)</li> <li>Specify Product Line Enhancements</li> <li>Specify SW Detailed Design (CS)</li> <li>Update Product and System Architecture</li> <li>Update and Maintain System Architecture</li> </ul>","Only Use Fully End-to-End Encrypted Messengers","End-to-end encryption is a system of communication where messages are encrypted on your device and not decrypted until they reach the intended recipient. This ensures that any actor who intercepts traffic cannot read the message contents, nor can anybody with access to the central servers where data is stored.",{"point":"4p","priority":"6","details":"4q"},{"point":"19","priority":"6","details":"1a"},"Identify, Analyze and Specify Product Line Enhancements","Evaluate existing products and identify necessary enhancements.",{"point":"4t","priority":"6","details":"4u"},"Substantiate and Rank Requirements","Validate and prioritize the gathered requirements.",{"point":"4w","priority":"6","details":"4x"},"Design test cases and plans for product and system testing.",{"point":"5","priority":"6","details":"4z"},"Create Product and System Test Plan","Develop a comprehensive test plan for product and system testing.",{"point":"51","priority":"6","details":"52"},"Create SW Detailed Design (Standard)","Develop a detailed design for software following standard guidelines.",{"point":"54","priority":"6","details":"55"},{"point":"1c","priority":"6","details":"1d"},"Define SW Development Infrastructure (Standard)","Set up the necessary infrastructure for software development as per standards.",{"point":"58","priority":"6","details":"59"},"Specify Product Line Enhancements","Define detailed specifications for the identified product line enhancements.",{"point":"5b","priority":"6","details":"5c"},"Specify SW Detailed Design (CS)","Create a detailed software design for custom solutions.",{"point":"5e","priority":"6","details":"5f"},"Revise and update the product and system architecture as needed.",{"point":"1o","priority":"6","details":"5h"},"Update and Maintain System Architecture","Continuously update and maintain the overall system architecture.",{"point":"5j","priority":"6","details":"5k"},"Implement Software (CS)","Develop and implement custom software solutions.",{"point":"5m","priority":"6","details":"5n"},"Implement Software (Standard)","Develop and implement software following standard practices.",{"point":"5p","priority":"6","details":"5q"},"Perform Incremental Product Test","Conduct incremental testing on the product to ensure functionality.",{"point":"5s","priority":"6","details":"5t"},"Perform Incremental System Test","Conduct incremental testing on the system to ensure functionality.",{"point":"5v","priority":"6","details":"5w"},"Perform Penetration Testing (Standard)","Perform standard penetration testing to identify security vulnerabilities.",{"point":"5y","priority":"6","details":"5z"},"Perform Product Security Threat and Risk Analysis","Analyze and identify potential security threats and risks to the product.",{"point":"61","priority":"6","details":"62"},"Perform Product Test","Conduct comprehensive testing on the product.",{"point":"64","priority":"6","details":"65"},"Perform System Test","Conduct comprehensive testing on the system.",{"point":"67","priority":"6","details":"68"},"Update Overall Test Plan","Revise and update the overall test plan as needed.",{"point":"6a","priority":"6","details":"6b"},"Monitor and Handle Security Vulnerabilities","Continuously monitor and address any security vulnerabilities.",{"point":"6d","priority":"6","details":"6e"},"Incident Handling","Manage and resolve incidents as they occur.",{"point":"6g","priority":"6","details":"6h"},"Provide Architecture Coaching","Offer guidance and coaching on system architecture.",{"point":"6j","priority":"6","details":"6k"},"Perform PSS Project Classification (Standard)","Classify projects based on standard Product Security Standards (PSS).",{"point":"6m","priority":"6","details":"6n"},"Evaluate and plan the integration of third-party software components. with your data and meta-data. You cannot verify that the system running is authentic without back doors.",{"point":"1l","priority":"6","details":"6p"},["4r","4s","4v","4y","50","53","56","57","5a","5d","5g","5i","5l","5o","5r","5u","5x","60","63","66","69","6c","6f","6i","6l","6o","6q"],"cyan",{"title":"4k","slug":"4l","description":"4m","icon":"4n","intro":"4o","checklist":"6r","color":"6s"},"Process Compliance","social-media","Minimizing the risks associated with using online communities","social","Online communities have existed since the invention of the internet, and give people around the world the opportunity to connect, communicate and share. Although these networks are a great way to promote social interaction and bring people together, that have a dark side - there are some serious [Privacy Concerns with Social Networking Services](https://en.wikipedia.org/wiki/Privacy_concerns_with_social_networking_services), and these social networking sites are owned by private corporations, and that they make their money by collecting data about individuals and selling that data on, often to third party advertisers.\nSecure your account, lock down your privacy settings, but know that even after doing so, all data intentionally and non-intentionally uploaded is effectively public. If possible, avoid using conventional social media networks.\n","Secure your Account","Social media profiles get stolen or taken over all too often. To protect your account: use a unique and strong password, and enable 2-factor authentication.",{"point":"6z","priority":"6","details":"70"},"Check Privacy Settings","Most social networks allow you to control your privacy settings. Ensure that you are comfortable with what data you are currently exposing and to whom.",{"point":"72","priority":"6","details":"73"},"Think of All Interactions as Public","There are still numerous methods of viewing a users 'private' content across many social networks. Therefore, before uploading, posting or commenting on anything, think \"Would I mind if this was totally public?\"",{"point":"75","priority":"6","details":"76"},"Think of All Interactions as Permanent","Pretty much every post, comment, photo etc is being continuously backed up by a myriad of third-party services, who archive this data and make it indexable and publicly available almost forever.",{"point":"78","priority":"6","details":"79"},"Don't Reveal too Much","Profile information creates a goldmine of info for hackers, the kind of data that helps them personalize phishing scams. Avoid sharing too much detail (DoB, Hometown, School etc).",{"point":"7b","priority":"6","details":"7c"},"Be Careful what you Upload","Status updates, comments, check-ins and media can unintentionally reveal a lot more than you intended them to. This is especially relevant to photos and videos, which may show things in the background.",{"point":"7e","priority":"6","details":"7f"},"Don't Share Email or Phone Number","Posting your real email address or mobile number, gives hackers, trolls and spammers more munition to use against you, and can also allow separate aliases, profiles or data points to be connected.",{"point":"7h","priority":"6","details":"7i"},"Don't Grant Unnecessary Permissions","By default many of the popular social networking apps will ask for permission to access your contacts, call log, location, messaging history etc. If they don’t need this access, don’t grant it.",{"point":"7k","priority":"6","details":"7l"},"Be Careful of 3rd-Party Integrations","Avoid signing up for accounts using a Social Network login, revoke access to social apps you no longer use.",{"point":"7n","priority":"6","details":"7o"},"Avoid Publishing Geo Data while still Onsite","If you plan to share any content that reveals a location, then wait until you have left that place. This is particularly important when you are taking a trip, at a restaurant, campus, hotel/resort, public building or airport.",{"point":"7q","priority":"6","details":"7r"},"Remove metadata before uploading media","Most smartphones and some cameras automatically attach a comprehensive set of additional data (called EXIF data) to each photograph. Remove this data before uploading.",{"point":"7t","priority":"a","details":"7u"},"Implement Image Cloaking","Tools like Fawkes can be used to very subtly, slightly change the structure of faces within photos in a way that is imperceptible by humans, but will prevent facial recognition systems from being able to recognize a given face.",{"point":"7w","priority":"2o","details":"7x"},"Consider Spoofing GPS in home vicinity","Even if you yourself never use social media, there is always going to be others who are not as careful, and could reveal your location.",{"point":"7z","priority":"2o","details":"80"},"Consider False Information","If you just want to read, and do not intend on posting too much- consider using an alias name, and false contact details.",{"point":"82","priority":"2o","details":"83"},"Don’t have any social media accounts","Social media is fundamentally un-private, so for maximum online security and privacy, avoid using any mainstream social networks.",{"point":"85","priority":"2o","details":"86"},["71","74","77","7a","7d","7g","7j","7m","7p","7s","7v","7y","81","84","87"],"Alternative Social Media","https://github.com/Lissy93/awesome-privacy#social-networks",{"title":"89","url":"8a"},"Alternative Video Platforms","https://github.com/Lissy93/awesome-privacy#video-platforms",{"title":"8c","url":"8d"},"Alternative Blogging Platforms","https://github.com/Lissy93/awesome-privacy#blogging-platforms",{"title":"8f","url":"8g"},"News Readers and Aggregation","https://github.com/Lissy93/awesome-privacy#news-readers-and-aggregation",{"title":"8i","url":"8j"},["8b","8e","8h","8k"],"blue",{"title":"6u","slug":"6v","description":"6w","icon":"6x","intro":"6y","checklist":"88","softwareLinks":"8l","color":"8m"},"OWASP Top 10","owasp-security","Taking measures to comply OWASP security guidelines","physical","Public records often include sensitive personal data (full name, date of birth, phone number, email, address, ethnicity etc), and are gathered from a range of sources (census records, birth/ death/ marriage certificates, voter registrants, marketing information, customer databases, motor vehicle records, professional/ business licenses and all court files in full detail). This sensitive personal information is [easy and legal to access](https://www.consumerreports.org/consumerist/its-creepy-but-not-illegal-for-this-website-to-provide-all-your-public-info-to-anyone/), which raises some [serious privacy concerns](https://privacyrights.org/resources/public-records-internet-privacy-dilemma) (identity theft, personal safety risks/ stalkers, destruction of reputations, dossier society)\n\nCCTV is one of the major ways that the corporations, individuals and the government tracks your movements. In London, UK the average person is caught on camera about 500 times per day. This network is continuing to grow, and in many cities around the world, facial recognition is being rolled out, meaning the state can know the identity of residents on the footage in real-time.\nStrong authentication, encrypted devices, patched software and anonymous web browsing may be of little use if someone is able to physically compromise you, your devices and your data. This section outlines some basic methods for physical security","Destroy Sensitive Documents","Shred or redact sensitive documents before disposal to protect against\nidentity theft and maintain confidentiality.\n",{"point":"8t","priority":"6","details":"8u"},"Opt-Out of Public Records","Contact people search websites to opt-out from listings that show persona\ninformation, using guides like Michael Bazzell's Personal Data Removal Workbook.\n",{"point":"8w","priority":"6","details":"8x"},"Watermark Documents","Add a watermark with the recipient's name and date to digital copies of\npersonal documents to trace the source of a breach.\n",{"point":"8z","priority":"6","details":"90"},"Don't Reveal Info on Inbound Calls","Only share personal data on calls you initiate and verify the recipient's phone number.\n",{"point":"92","priority":"6","details":"93"},"Stay Alert","Be aware of your surroundings and assess potential risks in new environments.",{"point":"95","priority":"6","details":"96"},"Secure Perimeter","Ensure physical security of locations storing personal info devices, minimizing external access and using intrusion detection systems.",{"point":"98","priority":"6","details":"99"},"Physically Secure Devices","Use physical security measures like Kensington locks, webcam covers, and privacy screens for devices.",{"point":"9b","priority":"6","details":"9c"},"Keep Devices Out of Direct Sight","Prevent devices from being visible from outside to mitigate risks from lasers and theft.",{"point":"9e","priority":"6","details":"9f"},"Protect your PIN","Shield your PIN entry from onlookers and cameras, and clean touchscreens after use.",{"point":"9h","priority":"6","details":"9i"},"Check for Skimmers","Inspect ATMs and public devices for skimming devices and tampering signs before use.",{"point":"9k","priority":"6","details":"9l"},"Protect your Home Address","Use alternative locations, forwarding addresses, and anonymous payment methods to protect your home address.",{"point":"9n","priority":"a","details":"9o"},"Use a PIN, Not Biometrics","Prefer PINs over biometrics for device security in situations where legal coercion to unlock devices may occur.",{"point":"9q","priority":"2o","details":"9r"},"Reduce exposure to CCTV","Wear disguises and choose routes with fewer cameras to avoid surveillance.",{"point":"9t","priority":"2o","details":"9u"},"Anti-Facial Recognition Clothing","Wear clothing with patterns that trick facial-recognition technology.",{"point":"9w","priority":"2o","details":"9x"},"Reduce Night Vision Exposure","Use IR light sources or reflective glasses to obstruct night vision cameras.",{"point":"9z","priority":"2o","details":"a0"},"Protect your DNA","Avoid sharing DNA with heritage websites and be cautious about leaving DNA traces.",{"point":"a2","priority":"2o","details":"a3"},["8v","8y","91","94","97","9a","9d","9g","9j","9m","9p","9s","9v","9y","a1","a4"],"lime",{"title":"8o","slug":"8p","description":"8q","icon":"8r","intro":"8s","checklist":"a5","color":"a6"},["14","1w","27","3e","3t","4j","6t","8n","a7"],{"R4G1hVIrQpw":"a8"},"\u0001",200,"/",{"loaders":"a9","action":"aa","status":"ab","href":"ac"}]}